<?php

return [

	/*
		|--------------------------------------------------------------------------
		| 默认队列连接名
		|--------------------------------------------------------------------------
		|
		| Laravel的队列API通过单一的方式支持各种各样的后端
		| API，让您可以使用相同的方式访问每个后端
		| 每个人的语法。在这里，您可以定义一个默认连接。
		|
	*/

	'default_issync' => env('QUEUE_ISSYNC', true),

	'default_engine' => env('QUEUE_ENGINE'),

	/*
		|--------------------------------------------------------------------------
		| 队列连接
		|--------------------------------------------------------------------------
		|
		| 在这里，您可以为每个服务器配置连接信息
		| 被应用程序使用。添加了默认配置
		| 每个后端都有laravel。你可以自由地添加更多。
	*/

	'connections' => [

		'activemq' => [
			'driver' => 'activemq', //队列驱动
			'host' => env('MQ_HOST'), //主机地址
			'port' => env('MQ_PORT'), //主机端口
			'user' => env('MQ_USER'), //连接用户名
			'passsword' => env('MQ_PASSWORD'), //连接密码
		],

	],

	/*
		|--------------------------------------------------------------------------
		| 失败的工作队列
		|--------------------------------------------------------------------------
		|
		| 这些选项配置失败队列作业日志的行为，这样您就可以
		| 可以控制使用哪个数据库和表来存储作业
		| 已经失败了。您可以将它们更改为您希望的任何数据库/表。
		|
	*/

	'failed' => [
		'database' => env('DB_CONNECTION', 'mysql'),
		'table' => 'failed_jobs',
	],

];
